{

    "takeoff.nameOfTheNewTakeoff" : "name of the new takeoff",
    "takeoff.nameOfTheNewTakeoffCategors" : "name of the new takeoff category",
    "takeoff.nameOfTheNewTakeoffPage" : "name of the new takeoff page",

    "takeoff.createNewTakeoff" : "Create new takeoff.",
    "takeoff.createNewTakeoffCategors" : "Create new takeoff category.",
    "takeoff.createNewTakeoffPage" : "Create new takeoff page.",
	
	"takeoff.nameOfTheTakeoff" : "name of the takeoff",
    "takeoff.nameOfTheTakeoffCategors" : "name of the takeoff category",
    "takeoff.nameOfTheTakeoffPage" : "name of the takeoff page",

    "takeoff.openCloseTakeoffWindow" : "Open / Close Takeoff manager window",
    "takeoff.openClosePlanWindow" : "Open / Close plan manager window",
    "takeoff.freezePlan" : "Freeze the plan image",
    "takeoff.freezeDrawing" : "Freeze the takeoff overlay",
    "save": "Save",
    "load": "Load",
    "takeoff.saveLoadPlanPart" : "At saving and loading include the plan part",
    "takeoff.saveLoadDrawingPart" : "At saving and loading include the takeoff part",
    "length": "length",
    "takeoff.selectedTakeoffMeasurementUnit": "The selected measurement unit for the takeoff. (quantity, length, are, volume)",
    "takeoff.planScalerLineLength": "The length of the Plan Scalar Line in the given measurement unit.",
    "takeoff.planScalerLineMeasurementUnit": " The measurement unit of the Plan Scalar Line",
    "takeoff.planScalerLineDrawMode": "Activates the Plan Scalar Line drawing mode",
    "quantity": "qty",
    "takeoff.theQuantityOfTheTakeoffElement": "The quantity of the takeoff element which you are about to draw.",
    "takeoff.manualValueDrawingMode": "Activates the pointer drawing element with which you can specify values manually in the given measurement unit",
    "takeoff.manualValueMeasurementUnitAndValue": "Specify the value in the given measurement unit of the pointer takeoff element which you are about to draw.",
    "takeoff.lengthLineDraw": "Activates the line takeoff draw element with which you can specify length.",
    "takeoff.lengthLinePitch": "Specify the pitch of the line which you are about to draw.",
    "takeoff.lengthRectangelDraw": "Activates the rectangle takeoff draw element with which you can specify length.",
    "takeoff.lengthArcAndLineChainDraw": "Activates the arc and line chain takeoff draw element with which you can specify length.",
    "takeoff.arcAndLineChainArcSegmentDraw": "Activates the arc segment draw. You can select between arc and line throughout the arc and line chain drawing process.",
    "takeoff.arcAndLineChainLineSegmentDraw": "Activates the line segment draw. You can select between arc and line throughout the arc and line chain drawing process.",
    "takeoff.areaLineHeight": "Activates the line takeoff draw element with which you can specify area what is parallel to your view angle.",
    "takeoff.areaLineHeightActualHeight": "Specify the height of the area line which you are about to draw. With this tool you are able to create an area which is parallel to your view angle.",
    "takeoff.areaArcAndLineChainDraw": "Activates the arc and line chain takeoff draw element with which you can specify area what is parallel to your view angle.",
    "takeoff.areaArcAndLineChainDrawActualHeight": "Specify the height of the area arc and line chain which you are about to draw. With this tool you are able to create an area which is parallel to your view angle.",
    "takeoff.areaRectangleDraw": "Activates the rectangle takeoff draw element with which you can specify area what is perpendicular to your view angle.",
    "takeoff.areaRectangleDrawPitch": "Specify the pitch of the rectangle area which you are about to draw.",
    "takeoff.ArcAndLineChainPerpedicularDraw": "Activates the arc and line chain takeoff draw element with which you can specify area what is perpendicular to your view angle.",
    "takeoff.ArcAndLineChainPerpedicularDrawPitch": "Specify the pitch of the  arc and line chain area which you are about to draw.",
    "takeoff.volumeRectangle": "Activates the rectangle takeoff draw element with which you can specify volume.",
    "takeoff.volumeRectangleDepth": "Specify the depth of the rectangle area which you are about to draw.",
    "takeoff.volumeArcAndLineChain": "Activates the arc and line chain takeoff draw element with which you can specify volume.",
    "takeoff.volumeArcAndLineChainDepth": "Specify the depth of the arc and line chain area which you are about to draw.",
    "takeoff.arcAndLineChainDrawingTool": "Activates the arc and line chain draw element which is a simple drawing tool. This element doesn't have a value so it will not be included in the calculation.",
    "takeoff.arcAndLineChainMeasurementTool": "Activates the arc and line chain draw element which is a simple measurement tool. This element doesn't have a value so it will not be included in the calculation.",
    "takeoff.deduction": "On / Off deduction. If it is on it will mark the element as a deduction which you are about to draw.",
    "takeoff.takeIntoCalculation": "On / Off calculation. If it is on it will include the takeoff element in the calculation which you are about to draw.",
    "takeoff.takeoffElementAdditionalText": "Specify additional infomation note for the takeoff element which you are about to draw.",
    "takeoff.selectionMode": "Activates the selection and modification mode. You can select and modify the properties of the takeoff elements.",
    "takeoff.outlineColor": "Specify the color of the outline of the takeoff element which you are about to draw.",
    "takeoff.outlineOpacity": "Specify the opacity of the outline of the takeoff element which you are about to draw.",
    "takeoff.fillColor": "Specify the color of the filling of the takeoff element which you are about to draw.",
    "takeoff.fillOpacity": "Specify the opacity of the filling of the takeoff element which you are about to draw.",
    "takeoff.takeoffPageLevelCalculation": "Takeoff page level calculation result. This is the calculation result of the takeoff elements on this page.",
    "height" : "height",
    "scalar": "scalar",
    "depth": "depth",
    "pitch": "pitch",
    "pieces": "pcs",
    "takeoff.theQuantityOfTheTakeoffElementChange": "Change the quantity of the selected takeoff element.",
    "takeoff.planScalerLineLengthChange": "Change the length in the given measurement unit of the selected Plan Scalar Line.",
    "takeoff.manualValueMeasurementUnitAndValueChange": "Change the value in the given measurement unit of the manually specified takeoff element.",
    "takeoff.areaLineHeightActualHeightChange": "Change the height of the parallel area of the selected takeoff element.",
    "takeoff.volumeAreaDepth": "Change the depth of the perpendicular area of the selected takeoff element.",
    "takeoff.pitchChange": "Change the pitch of the selected takeoff element.",
    "takeoff.deductionChange": "Change the deduction status (On / Off) of the selected takeoff element.",
    "takeoff.takeIntoCalculationChange": "Change the calculation status (On / Off) of the selected takeoff element.",
    "takeoff.takeoffElementAdditionalTextChange": "Change the additional infomation note of the selected takeoff element.",
    "takeoff.outlineColorChange": "Change the color of the outline of the selected takeoff element.",
    "takeoff.outlineOpacityChange": "Change the opacity of the outline of the selected takeoff element.",
    "takeoff.fillColorChange": "Change the color of the filling of the selected takeoff element.",
    "takeoff.fillOpacityChange": "Change the opacity of the filling of the selected takeoff element.",
    "takeoff.deleteSelectedShape": "Delete the selected takeoff element." ,
    "takeoff.tooltipOnOff": "On / Off tooltip",
    "closeTheWindow": "Close the window.",
    "dragTheWindow": "Window drag and drop handler.",
    "takeoff.takeoffCategoryName": "The name of the takeoff category which you are about to create.",
    "takeoff.takeoffCategoryCreate": "New takeoff category creation.",
    "takeoff.takeoffCategoryDrag": "Takeoff category drag and drop handler.",
    "takeoff.takeoffCategoryDropdownMenu": "Takeoff category dropdown menu. Hide or Show the takeoffs in this category.",
    "takeoff.takeoffCategory": "Takeoff category",
    "takeoff.takeoffCategoryNameChange": "Change the name of the takeoff category.",
    "takeoff.takeoffCategoryCopy": "Make a copy of this takeoff category.",
    "takeoff.takeoffCategoryDelete": "Delete the takeoff category.",

    "takeoff.takeoffName": "The name of the takeoff which you are about to create.",
    "takeoff.takeoffCreate": "New takeoff creation.",
    "takeoff.takeoffDrag": "Takeoff drag and drop handler.",
    "takeoff.takeoffDropdownMenu": "Takeoff dropdown menu. Hide or Show the takeoff pages in this takeoff.",
    "takeoff.takeoff": "Takeoff",
    "takeoff.takeoffNameChange": "Change the name of the takeoff.",
    "takeoff.takeoffCopy": "Make a copy of this takeoff.",
    "takeoff.takeoffDelete": "Delete the takeoff.",
    "takeoff.takeoffQuantity": "By selecting this the takeoff measurement type will be quantity.",
    "takeoff.takeoffLength": "By selecting this the takeoff measurement type will be length.",
    "takeoff.takeoffArea": "By selecting this the takeoff measurement type will be area.",
    "takeoff.takeoffVolume": "By selecting this the takeoff measurement type will be volume.",
    "takeoff.takeoffMeasurementUnitSelect": "Select the measurement unit for this takeoff.",
    "takeoff.takeoffMeasurementUnit": "The selected measurement unit for this takeoff. (quantity / length / area / volume)",
    "takeoff.takeoffDecimalsChange": "Change the length of the fractional part of the numbers.",
    "takeoff.takeoffImperialStyle": "Change the style of the imperial measurement system. ",
    "takeoff.takeoffResult": "The result of the takeoff elements on this takeoff.",

    "takeoff.takeoffPageName": "The name of the takeoff page which you are about to create.",
    "takeoff.takeoffPageCreate": "New takeoff page creation.",
    "takeoff.takeoffPageDrag": "Takeoff page drag and drop handler.",
    "takeoff.takeoffPageActivate": "Make this takeoff page active (On / Off). If it is active you can draw new takeoff elements on this tkeoff page.",
    "takeoff.takeoffPageNameChange": "Change the name of the takeoff page.",
    "takeoff.planPageSelect": "Select a plan page which will be placed on the drawing board and you can draw over it.",
    "takeoff.takeoffPageCopy": "Make a copy of this takeoff page.",
    "takeoff.takeoffPageDelete": "Delete the takeoff page.",
    "takeoff.takeoffPageDecimalsChange": "Change the length of the fractional part of the numbers.",
    "takeoff.takeoffPageImperialStyle": "Change the style of the imperial measurement system. ",
    "takeoff.takeoffPageResult": "The result of the takeoff elements on this takeoff page.",
    "takeoff.takeoffPageOverrideColorAndOpacity": "Override (On / Off) the color and opacity on this takeoff page.",
    "takeoff.overrideOutlineColorChange": "Override the color of the outline of the elements of the takeoff page.",
    "takeoff.overrideOutlineOpacityChange": "Override the opacity of the outline of the elements of the takeoff page element.",
    "takeoff.overrideFillColorChange": "Override the color of the filling of the elements of the takeoff page .",
    "takeoff.overrideFillOpacityChange": "Change the opacity of the filling of the elements of the takeoff page.",
    "takeoff.fontSizeOnTakeoffPage": "Change the size of the fonts on this takeoff page.",
    "takeoff.lineWidthOnTakeoffPage": "Change the width of the lines on this takeoff page.",
    "takeoff.resultBoxOnTakeoffPage": "Change (On / Off) the result box visibility on this takeoff page.",

    "takeoff.planDropPlan": "Drag and drop pdf, jpg, png files here.",
    "takeoff.planDrag": "Plan drag and drop handler.",
    "takeoff.planFile": "Plan.",
    "takeoff.planPage": "Plan page.",
    "takeoff.planNameChange": "Change the name of the plan.",
    "takeoff.planDelete": "Remove the plan.",
    "takeoff.planPageNameChange": "Change the name of the plan page.",

    "takeoff.the3PointsInOneLine": "The 3 point which supposed to define the circle line up !",
    "languageSelector": "Language selector.",
    "takeoff.theLinesIntersect": "The lines have intersections !",
    "takeoff.closeTheShapeOrAbandone": "You have to close the sape or press delete to abandone this takeoff element !",
    "thisIsNotANumber": "The '{{theNumber}}' is not a number. "





}